SDS: simple dynamic string(简单动态字符串)，经过C字符串优化而来
区别：
1. SDS数据结构中多了len属性、free属性
  所以SDS如果需要计算字符串长度，直接调用len属性即可，而且这个属性是数据结构自动维护更新，无需人工处理，获取长度复杂度由C字符串的O(N)变成O(1)
  
2. SDS不会造成字符串缓冲区溢出
  在进行拼接操作时，如果C字符串操作出现问题，没有预留空间，那么就会出现字符串缓冲区溢出的问题；
  而SDS不会，在拼接字符串的时候，SDS会自动对比free和新增字符串的长度，如果不够，那么就会自动扩容，避免出现缓冲区溢出的问题，修改原字符串内容
  而且SDS扩容时，会自动扩容，变为原来的2N+1的长度的字节（N最多1MB），可以减少了内存重分配操作的次数，由C字符串的指定N次，变为现在的最多N次
  
3. 惰性空间释放：SDS删除一定数据的时候，会保留空闲空间，并记录free，防止后续新增操作时，又要频繁进行内存重分配操作；
   也支持手动调用方法释放SDS的未使用空间，也可以避免造成内存浪费

4. 由于C字符串是以判断空格为结尾符号，所以C字符串不允许保存二进制数据，会出现判断结尾失误的情况；
  而SDS为了能够保存二进制数据，特意试用len来判断字符串结尾，可以避免判断失误的情况，允许保存二进制数据，而且保证数据安全性，存入和取出的数据一致  
  
5. 由于SDS是由C优化而来，而且结尾也使用了空格结尾的格式，所以SDS也可以使用部分C字符串的函数，比如说：strcat(c_string, sds);
